[
  "obsidian-dictionary-plugin",
  "hotkey-helper",
  "note-refactor-obsidian",
  "quickadd",
  "obsidian-plugin-toc",
  "workbench-obsidian",
  "darlal-switcher-plus",
  "obsidian-todoist-tasks",
  "todoist-sync-plugin",
  "better-word-count",
  "templater-obsidian",
  "obsidian-tracker",
  "table-editor-obsidian",
  "folder-note-plugin",
  "find-unlinked-files",
  "extract-highlights-plugin",
  "export-markdown-with-embeds-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "pdf-to-markdown-plugin",
  "recent-files-obsidian",
  "obsidian-fullscreen-plugin",
  "obsidian-timelines",
  "obsidian-languagetool-plugin",
  "tag-wrangler",
  "obsidian-style-settings",
  "obsidian-kanban",
  "obsidian-outliner",
  "media-extended",
  "obsidian-hider",
  "hotkeysplus-obsidian",
  "obsidian-markdown-formatting-assistant-plugin",
  "obsidian-activity-history",
  "calendar",
  "obsidian-markdown-insert-plugin",
  "obsidian-minimal-settings"
]