[
  "cm-editor-syntax-highlight-obsidian",
  "media-extended",
  "hotkey-helper",
  "obsidian-dictionary-plugin",
  "recent-files-obsidian",
  "obsidian-reveal-active-file",
  "txt-as-md-obsidian",
  "obsidian-minimal-settings",
  "better-word-count",
  "csv-obsidian",
  "hotkeysplus-obsidian",
  "quickadd",
  "note-refactor-obsidian",
  "darlal-switcher-plus",
  "cycle-through-panes",
  "obsidian-advanced-uri",
  "extract-url",
  "obsidian-style-settings"
]