[
  "obsidian-dictionary-plugin",
  "hotkey-helper",
  "note-refactor-obsidian",
  "quickadd",
  "obsidian-plugin-toc",
  "darlal-switcher-plus",
  "obsidian-todoist-tasks",
  "todoist-sync-plugin",
  "better-word-count",
  "templater-obsidian",
  "obsidian-tracker",
  "table-editor-obsidian",
  "folder-note-plugin",
  "find-unlinked-files",
  "extract-highlights-plugin",
  "export-markdown-with-embeds-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "recent-files-obsidian",
  "obsidian-fullscreen-plugin",
  "obsidian-timelines",
  "obsidian-languagetool-plugin",
  "tag-wrangler",
  "obsidian-style-settings",
  "media-extended",
  "hotkeysplus-obsidian",
  "obsidian-activity-history",
  "obsidian-markdown-insert-plugin",
  "cycle-through-panes",
  "file-tree-alternative",
  "obsidian-icons-plugin",
  "juggl",
  "obsidian-mind-map",
  "obsidian-pandoc",
  "mrj-text-expand",
  "convert-url-to-iframe",
  "obsidian-collapse-all-plugin",
  "mrj-crosslink-between-notes",
  "csv-obsidian",
  "obsidian-minimal-settings",
  "pdf-to-markdown-plugin",
  "homepage"
]